1.1 h) Вычислить значение выражений pred (true)
  Ответ:0
1.2 7) Вычислить значения выражений  not (a and b)
 Ответ:1
1.3 2) Указать порядок выполнения операций при вычислении выражения (надписав над знаком операции номер действия):
 Ответ:a and(2) b or(4) not(1) c and(3) d 
1.4 5) Объяснить ошибки в следующих записях: x>0 or y=4.
 Ответ: вместо or нужно написать and
1.5 a) Записать на Паскале выражение, истинное при выполнении указанного условия и ложное в противном случае: 0<X<1
 Ответ: 
var x:boolean
x:=x>0 and x<1 
1.6 t) Составить программу, печатающую значение true, если указанное высказывание является истинным, и false в противном случае:данные числа c и d являются соответственно квадратом и кубом числа а;
 Ответ: program U;
var a,c,d:integer;
begin
  writeln('a=');
  readln(a);
  writeln('c=');
  readln(c);
  writeln('d=');
  readln(d);
  if (c=a*a) and (d=a*a*a) then
    writeln('True')
  else
    writeln('False')
end.
1.7 2)  Переменной T присвоить значение выражения, истинного при выполнении указанного условия и ложного в противном случае:  целое число n кратно 4; 
 Ответ: var T,n:integer;
begin
writeln('Введите n');
readln(n);
if n mod 4=0 then
writeln('t Истинно')
else
writeln('t Ложно');
end.
2.20 Составить программу, которая для любого натурального числа меньшего или равного 10000 печатает количество цифр в записи этого числа.
 Ответ: 
var a:integer;
begin
  write('Введите число '); Readln(a);
  if a<=10000 then
    case a of
      1..9: writeln('1 цифра');
      10..99: writeln('2 цифры');
      100..999: write('3 цифры');
      1000..9999: write('4 цифры');
      10000: write ('5 цифер');
     end
  else
    writeln('Число больше 10000');
 end.